---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition
source: html/81633228-fa93-c472-b26b-854699611cf7.htm
---
# RebarShapeMultiplanarDefinition Properties

Id of the parameter driving the multiplanar depth.
 The depth is measured center-to-center of the bar.
 A valid shape parameter must be assigned to DepthParamId before
 the MultiplanarDefinition can be used in RebarShape creation.